{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "Маша и Катя делают домашнее задание по Обществознанию, в котором нужно Написать Блага и распределить их по группам. Но учитель боится, что ученики могут у друг-друга списать. Помогите ему сделать программу, при которой если обнаружено в двух множествах повторяющиеся (одно или два), выводит \"Под рассмотрением\", если повторяющихся три или больше, программа выводит \"Работы списаны\". Если повторений нет, программа выводит \"работы не списаны\".\n",
        "\n",
        "---\n",
        "\n",
        "\n",
        " |Формат Ввода:\n",
        "1. Список Благ Маши через пробел\n",
        "2. Список Благ Кати через пробел\n",
        "\n",
        "---\n",
        "\n",
        "\n",
        " |Формат Вывода:\n",
        "\n",
        "Одна из фраз, описанных в условии, смотря на количество повторений.\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "\n",
        "\n",
        "\n",
        " |Примеры:\n",
        "\n",
        " Ввод:\n",
        "\n",
        "Вода учеба кровать\n",
        "\n",
        "Вода жилье пианино\n",
        "\n",
        "Вывод:\n",
        "\n",
        "-\n",
        "Под рассмотрением\n",
        "\n",
        "---\n",
        "Ввод:\n",
        "\n",
        " Бумага Тетрадь Карандаш телефон\n",
        "\n",
        " компьютер Бумага Карандаш Тетрадь\n",
        "\n",
        "\n",
        "Вывод:\n",
        "\n",
        "Работы Списаны\n",
        "\n"
      ],
      "metadata": {
        "id": "FH8kK_nWhnNv"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "M = set(input())\n",
        "K = set(input())\n",
        "a = M&K\n",
        "a.remove(\" \")\n",
        "if len(a)==0:\n",
        "  print(\"работы не списаны\")\n",
        "if len(a)==1 or len(a)==2:\n",
        "  print(\"Под рассмотрением\")\n",
        "if len(a) >= 3:\n",
        "  print(\"Работы списаны\")\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "70iqFATthoLA",
        "outputId": "71839705-9668-42b1-eb5c-e5cc9d88b527"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "12 13 123 1313 13 \n",
            "76 76 6 6 76 677 67 \n",
            "работы не списаны\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "На пляж группой из 10 человек уехали ребята. Оказалось, что у некоторых из них одинаковые фамилии. Сделайте программу, выводящую повторяющиеся Имя и ее количество повторений.\n",
        "\n",
        "---\n",
        "Формат ввода:\n",
        "10 имен, каждая с новой строчки.\n",
        "\n",
        "---\n",
        "\n",
        "\n",
        "Формат вывода:\n",
        "Имя - ее количество повторений ( Выводить ТОЛЬКО имена, повторяющиеся 2 раза или больше)\n",
        "\n",
        "---\n",
        "\n",
        "Пример:\n",
        "\n",
        "Ввод:\n",
        "\n",
        "\n",
        "Катя\n",
        "Женя\n",
        "Катя\n",
        "Соня\n",
        "Иван\n",
        "Илья\n",
        "Катя\n",
        "Иван\n",
        "Саша\n",
        "Коля\n",
        "\n",
        "Вывод:\n",
        "\n",
        "Катя - 3\n",
        "Иван - 2\n"
      ],
      "metadata": {
        "id": "YpvHN4tOhuI6"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "a = dict()\n",
        "n = int(input())\n",
        "for i in range(n):\n",
        "   name = input().strip()\n",
        "    if name in a:\n",
        "        a[name] += 1\n",
        "    else:\n",
        "        a[name] = 1\n",
        "if a[name]==1:\n",
        "      a.pop(name)\n",
        "print(a)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "zdTw8xbahyx1",
        "outputId": "b21413c4-a867-4c7f-8bcb-653e24c594b5"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "3\n",
            "Катя\n",
            "Катя\n",
            "Женя\n",
            "{'Катя': 2}\n"
          ]
        }
      ]
    }
  ]
}